# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'coreutils'
brew 'git'
brew 'gnupg'
brew 'openssh'
brew 'ripgrep'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'tree'

# Development
brew 'node'
brew 'dotnet-sdk'
brew 'angular-cli'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'obsidian'

# Fonts
cask 'font-roboto'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-mono-nerd-font'
cask 'font-fira-sans-condensed'
cask 'font-fira-sans-extra-condensed'
cask 'font-fira-sans'

# Mac App Store
mas 'BetterSnapTool', id: 417375580
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Greenshot', id: 1103915944